[
  {
    "name": "Dragonborn",
    "source": "SRD",
    "scores": {
      "str": 2,
      "dex": 0,
      "con": 0,
      "int": 0,
      "wis": 0,
      "cha": 1
    },
    "speeds": {
      "walk": 30
    },
    "size": "Medium",
    "features": [
      "Breath Weapon. You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation. When you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level. After you use your breath weapon, you can't use it again until you complete a short or long rest.",
      "Damage Resistance. You have resistance to the damage type associated with your draconic ancestry."
    ],
    "darkvision": 60,
    "languages": [
      "Common",
      "Draconic"
    ],
    "draconic_ancestries": [
      {
        "dragon": "Black",
        "dmg_type": "Acid",
        "breath_weapon": "5 by 30 ft. line (Dex save)"
      },
      {
        "dragon": "Blue",
        "dmg_type": "Lightning",
        "breath_weapon": "5 by 30 ft. line (Dex save)"
      },
      {
        "dragon": "Brass",
        "dmg_type": "Fire",
        "breath_weapon": "5 by 30 ft. line (Dex save)"
      },
      {
        "dragon": "Bronze",
        "dmg_type": "Lightning",
        "breath_weapon": "5 by 30 ft. line (Dex save)"
      },
      {
        "dragon": "Copper",
        "dmg_type": "Acid",
        "breath_weapon": "5 by 30 ft. line (Dex save)"
      },
      {
        "dragon": "Gold",
        "dmg_type": "Fire",
        "breath_weapon": "15 ft. cone (Dex. save)"
      },
      {
        "dragon": "Green",
        "dmg_type": "Poison",
        "breath_weapon": "15 ft. cone (Con. save)"
      },
      {
        "dragon": "Red",
        "dmg_type": "Fire",
        "breath_weapon": "15 ft. cone (Dex. save)"
      },
      {
        "dragon": "Silver",
        "dmg_type": "Cold",
        "breath_weapon": "15 ft. cone (Con. save)"
      },
      {
        "dragon": "White",
        "dmg_type": "Cold",
        "breath_weapon": "15 ft. cone (Con. save)"
      }
    ],
    "age_fluff": "Young dragonborn grow quickly. They walk hours after hatching, attain the size and development of a 10-year-old human child by the age of 3, and reach adulthood by 15. They live to be around 80.",
    "size_fluff": "Dragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds."
  },
  {
    "name": "Dwarf (Hill)",
    "source": "SRD",
    "scores": {
      "str": 0,
      "dex": 0,
      "con": 2,
      "int": 0,
      "wis": 1,
      "cha": 0
    },
    "speeds": {
      "walk": 30
    },
    "size": "Medium",
    "features": [
      "Speed. Your speed is not reduced by wearing heavy armor.",
      "Stonecunning. Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus.",
      "Dwarven Toughness. Your hit point maximum increases by 1, and it increases by 1 every time you gain a level."
    ],
    "hp_mod": "+level",
    "st_mods": [
      "Adv against poison"
    ],
    "darkvision": 60,
    "languages": [
      "Common",
      "Dwarvish"
    ],
    "age_fluff": "Dwarves mature at the same rate as humans, but they're considered young until they reach the age of 50. On average, they live about 350 years.",
    "size_fluff": "Dwarves stand between 4 and 5 feet tall and average about 150 pounds.",
    "weapon_profs": [
      "battleaxe",
      "handaxe",
      "light hammer",
      "warhammer"
    ],
    "dmg_res": [
      "poison"
    ],
    "tool_prof_choices": [
      "mason's tools",
      "smith's tools",
      "brewer's supplies"
    ]
  },
  {
    "name": "Elf (High)",
    "source": "SRD",
    "scores": {
      "str": 0,
      "dex": 2,
      "con": 0,
      "int": 1,
      "wis": 0,
      "cha": 0
    },
    "speeds": {
      "walk": 30
    },
    "size": "Medium",
    "features": [
      "Fey Ancestry. Magic can't put you to sleep.",
      "Trance. Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is 'trance.') While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."
    ],
    "st_mods": [
      "Adv against being charmed"
    ],
    "darkvision": 60,
    "languages": [
      "Common",
      "Elvish"
    ],
    "language_choices": [
      "Abyssal",
      "Celestial",
      "Deep Speech",
      "Draconic",
      "Druidic",
      "Dwarvish",
      "Giant",
      "Gnomish",
      "Goblin",
      "Halfling",
      "Infernal",
      "Orc",
      "Primordial",
      "Sylvan",
      "Thieves' Cant",
      "Undercommon"
    ],
    "age_fluff": "Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old.",
    "size_fluff": "Elves range from under 5 to over 6 feet tall and have slender builds.",
    "weapon_profs": [
      "longsword",
      "shortsword",
      "shortbow",
      "longbow"
    ],
    "skill_profs": [
      "Perception"
    ]
  },
  {
    "name": "Gnome (Rock)",
    "source": "SRD",
    "scores": {
      "str": 0,
      "dex": 0,
      "con": 1,
      "int": 2,
      "wis": 0,
      "cha": 0
    },
    "speeds": {
      "walk": 25
    },
    "size": "Small",
    "features": [
      "Artificer's Lore. Whenever you make an Intelligence (History) check related to magic items, alchemical objects, or technological devices, you can add twice your proficiency bonus, instead of any proficiency bonus you normally apply.",
      "Tinker. Using tinker's tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time. When you create a device, choose one of the following options: Clockwork Toy. This toy is a clockwork animal, monster, or person, such as a frog, mouse, bird, dragon, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction. It makes noises as appropriate to the creature it represents. Fire Starter. The device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action. Music Box. When opened, this music box plays a single song at a moderate volume. The box stops playing when it reaches the song's end or when it is closed."
    ],
    "st_mods": [
      "Adv on INT, WIS, CHA against magic"
    ],
    "darkvision": 60,
    "languages": [
      "Common",
      "Gnomish"
    ],
    "age_fluff": "Gnomes mature at the same rate humans do, and most are expected to settle down into an adult life by around age 40. They can live 350 to almost 500 years.",
    "size_fluff": "Gnomes are between 3 and 4 feet tall and average about 40 pounds.",
    "tool_profs": [
      "tinker's tools"
    ]
  },
  {
    "name": "Half-Elf",
    "source": "SRD",
    "scores": {
      "str": 0,
      "dex": 0,
      "con": 0,
      "int": 0,
      "wis": 0,
      "cha": 2
    },
    "score_choices": {
      "num": 2,
      "exclu": true,
      "options": [
        "Str",
        "Dex",
        "Con",
        "Int",
        "Wis"
      ]
    },
    "speeds": {
      "walk": 30
    },
    "size": "Medium",
    "features": [
      "Fey Ancestry. Magic can't put you to sleep."
    ],
    "st_mods": [
      "Adv against being charmed"
    ],
    "darkvision": 60,
    "languages": [
      "Common",
      "Elvish"
    ],
    "language_choices": [
      "Abyssal",
      "Celestial",
      "Deep Speech",
      "Draconic",
      "Druidic",
      "Dwarvish",
      "Giant",
      "Gnomish",
      "Goblin",
      "Halfling",
      "Infernal",
      "Orc",
      "Primordial",
      "Sylvan",
      "Thieves' Cant",
      "Undercommon"
    ],
    "age_fluff": "Half-elves mature at the same rate humans do and reach adulthood around the age of 20. They live much longer than humans, however, often exceeding 180 years.",
    "size_fluff": "Half-elves are about the same size as humans, ranging from 5 to 6 feet tall.",
    "skill_prof_choices": {
      "num": 2,
      "exclu": true,
      "options": [
        "Acrobatics",
        "Animal Handling",
        "Arcana",
        "Athletics",
        "Deception",
        "History",
        "Insight",
        "Intimidation",
        "Investigation",
        "Medicine",
        "Nature",
        "Perception",
        "Performance",
        "Persuasion",
        "Religion",
        "Sleight of Hand",
        "Stealth",
        "Survival"
      ]
    }
  },
  {
    "name": "Half-Orc",
    "source": "SRD",
    "scores": {
      "str": 2,
      "dex": 0,
      "con": 1,
      "int": 0,
      "wis": 0,
      "cha": 0
    },
    "speeds": {
      "walk": 30
    },
    "size": "Medium",
    "features": [
      "Relentless Endurance. When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest.",
      "Savage Attacks. When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit."
    ],
    "darkvision": 60,
    "languages": [
      "Common",
      "Orc"
    ],
    "age_fluff": "Half-orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years.",
    "size_fluff": "Half-orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall.",
    "skill_profs": [
      "Intimidation"
    ]
  },
  {
    "name": "Halfling (Lightfoot)",
    "source": "SRD",
    "scores": {
      "str": 0,
      "dex": 2,
      "con": 0,
      "int": 0,
      "wis": 0,
      "cha": 1
    },
    "speeds": {
      "walk": 25
    },
    "size": "Small",
    "features": [
      "Lucky. When you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll.",
      "Halfling Nimbleness. You can move through the space of any creature that is of a size larger than yours.",
      "Naturally Stealthy. You can attempt to hide even when you are obscured only by a creature that is at least one size larger than you."
    ],
    "languages": [
      "Common",
      "Halfling"
    ],
    "age_fluff": "A halfling reaches adulthood at the age of 20 and generally lives into the middle of their second century.",
    "size_fluff": "Halflings average about 3 feet tall and weigh about 40 pounds. ",
    "st_mods": [
      "Adv against being frightened"
    ]
  },
  {
    "name": "Human",
    "source": "SRD",
    "scores": {
      "str": 1,
      "dex": 1,
      "con": 1,
      "int": 1,
      "wis": 1,
      "cha": 1
    },
    "speeds": {
      "walk": 30
    },
    "size": "Medium",
    "languages": [
      "Common"
    ],
    "language_choices": [
      "Abyssal",
      "Celestial",
      "Deep Speech",
      "Draconic",
      "Druidic",
      "Dwarvish",
      "Elvish",
      "Giant",
      "Gnomish",
      "Goblin",
      "Halfling",
      "Infernal",
      "Orc",
      "Primordial",
      "Sylvan",
      "Thieves' Cant",
      "Undercommon"
    ],
    "age_fluff": "Humans reach adulthood in their late teens and live less than a century.",
    "size_fluff": "Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall."
  },
  {
    "name": "Tiefling",
    "source": "SRD",
    "scores": {
      "str": 0,
      "dex": 0,
      "con": 0,
      "int": 1,
      "wis": 0,
      "cha": 2
    },
    "speeds": {
      "walk": 30
    },
    "size": "Medium",
    "languages": [
      "Common",
      "Infernal"
    ],
    "darkvision": 60,
    "dmg_res": [
      "fire"
    ],
    "spells": {
      "desc": "You know the thaumaturgy cantrip. Once you reach 3rd level, you can cast the hellish rebuke spell as a 2nd-level spell with this trait; you regain the ability to cast it when you finish a long rest. Once you reach 5th level, you can also cast the darkness spell once per day with this trait; you regain the ability to cast it when you finish a long rest. Charisma is your spellcasting ability for these spells.",
      "list": [
        {
          "lvl": 1,
          "name": "Thaumaturgy"
        },
        {
          "lvl": 3,
          "name": "Hellish Rebuke"
        },
        {
          "lvl": 5,
          "name": "Darkness"
        }
      ]
    },
    "age_fluff": "Tieflings mature at the same rate as humans but live a few years longer.",
    "size_fluff": "Tieflings are about the same size and build as humans."
  }
]